Revit 2027 API
MEPSystem.IsSystemDividable Method
 Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSystemDividable()
Public Function IsSystemDividable As Boolean
public:
bool IsSystemDividable()
member IsSystemDividable : unit -> bool
Return Value
Boolean
 True if the system can be divided.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace